# + 加法 ，两个对象相加

print(3 + 5)

print('a' + 'b')

# - 减法从一个数中减去另一个，如果一个操作数不存在，则假定为零/

print(50 - 26)

print(-5.2)

# * 乘法 给出2个数的乘积，或返回字符串重复指定次数后的结果

print(2 * 3)

print("I Love you" * 3)

# ** 乘方 ，返回X的Y次方

print(3 ** 4)

# / 除 ，X 除以 Y

print(13 / 3)

# // 整除, X 除以 Y 并对结果向下取整数最接近的整数。

print(13 // 3)

print(-13 // 3)


# % 取模，返回除法运算后的余数.

print(13 % 3)

print(-25.5 % 2.25)

# << 左移,将数字的位向左移动指定的位数。（每个数字在内存中以二进制数表示，即0和1）

print(2 << 2)  # 2用二进制表示为10，向左移动2位后得到1000，换算成十进制为 8



# >> 右移,将数字的位向右移动指定的位数。

print(11 >> 1)

